---
kind: enumMember
id: F:Autodesk.Revit.DB.ColumnAttachmentJustification.Minimum
enum: Autodesk.Revit.DB.ColumnAttachmentJustification
source: html/39a5a31b-dc66-8db0-1f12-07c22e3bac09.htm
---
# Autodesk.Revit.DB.ColumnAttachmentJustification.Minimum

Minimize the column extent, so that it comes in contact with the target but does not intersect.